# PressureLossNotSetInLossFamily Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..PressureLossNotSetInLossFamily Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
A calculation did not complete because the pressure loss value for the source equipment is not set for the network.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PressureLossNotSetInLossFamily { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PressureLossNotSetInLossFamily As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PressureLossNotSetInLossFamily {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace